ustropo/MT01/r_flash_api_rx/src/targets/rx210/r_flash_api_rx210.h
/* Array of flash addresses used for writing */
#if defined(FLASH_BLOCKS_DECLARE)
const uint32_t g_flash_BlockAddresses[260] = {
    0x00FFF800,  /* EB000 */
    0x00FFF000,  /* EB001 */
    0x00FFE800,  /* EB002 */
    0x00FFE000,  /* EB003 */
    0x00FFD800,  /* EB004 */
    0x00FFD000,  /* EB005 */
    0x00FFC800,  /* EB006 */
    0x00FFC000,  /* EB007 */
    0x00FFB800,  /* EB008 */
    0x00FFB000,  /* EB009 */
    0x00FFA800,  /* EB010 */
    0x00FFA000,  /* EB011 */
    0x00FF9800,  /* EB012 */
    0x00FF9000,  /* EB013 */
    0x00FF8800,  /* EB014 */
    0x00FF8000,  /* EB015 */
    0x00FF7800,  /* EB016 */
    0x00FF7000,  /* EB017 */
    0x00FF6800,  /* EB018 */
    0x00FF6000,  /* EB019 */
    0x00FF5800,  /* EB020 */
    0x00FF5000,  /* EB021 */
    0x00FF4800,  /* EB022 */
    0x00FF4000,  /* EB023 */
    0x00FF3800,  /* EB024 */
    0x00FF3000,  /* EB025 */
    0x00FF2800,  /* EB026 */
    0x00FF2000,  /* EB027 */
    0x00FF1800,  /* EB028 */
    0x00FF1000,  /* EB029 */
    0x00FF0800,  /* EB030 */
    0x00FF0000,  /* EB031 */
    0x00FEF800,  /* EB032 */
    0x00FEF000,  /* EB033 */
    0x00FEE800,  /* EB034 */
    0x00FEE000,  /* EB035 */
    0x00FED800,  /* EB036 */
    0x00FED000,  /* EB037 */
    0x00FEC800,  /* EB038 */
    0x00FEC000,  /* EB039 */
    0x00FEB800,  /* EB040 */
    0x00FEB000,  /* EB041 */
    0x00FEA800,  /* EB042 */
    0x00FEA000,  /* EB043 */
    0x00FE9800,  /* EB044 */
    0x00FE9000,  /* EB045 */
    0x00FE8800,  /* EB046 */
    0x00FE8000,  /* EB047 */
    0x00FE7800,  /* EB048 */
    0x00FE7000,  /* EB049 */
    0x00FE6800,  /* EB050 */
    0x00FE6000,  /* EB051 */
    0x00FE5800,  /* EB052 */
    0x00FE5000,  /* EB053 */
    0x00FE4800,  /* EB054 */
    0x00FE4000,  /* EB055 */
    0x00FE3800,  /* EB056 */
    0x00FE3000,  /* EB057 */
    0x00FE2800,  /* EB058 */
    0x00FE2000,  /* EB059 */
    0x00FE1800,  /* EB060 */
    0x00FE1000,  /* EB061 */
    0x00FE0800,  /* EB062 */
    0x00FE0000,  /* EB063 */
    0x00FDF800,  /* EB064 */
    0x00FDF000,  /* EB065 */
    0x00FDE800,  /* EB066 */
    0x00FDE000,  /* EB067 */
    0x00FDD800,  /* EB068 */
    0x00FDD000,  /* EB069 */
    0x00FDC800,  /* EB070 */
    0x00FDC000,  /* EB071 */
    0x00FDB800,  /* EB072 */
    0x00FDB000,  /* EB073 */
    0x00FDA800,  /* EB074 */
    0x00FDA000,  /* EB075 */
    0x00FD9800,  /* EB076 */
    0x00FD9000,  /* EB077 */
    0x00FD8800,  /* EB078 */
    0x00FD8000,  /* EB079 */
    0x00FD7800,  /* EB080 */
    0x00FD7000,  /* EB081 */
    0x00FD6800,  /* EB082 */
    0x00FD6000,  /* EB083 */
    0x00FD5800,  /* EB084 */
    0x00FD5000,  /* EB085 */
    0x00FD4800,  /* EB086 */
    0x00FD4000,  /* EB087 */
    0x00FD3800,  /* EB088 */
    0x00FD3000,  /* EB089 */
    0x00FD2800,  /* EB090 */
    0x00FD2000,  /* EB091 */
    0x00FD1800,  /* EB092 */
    0x00FD1000,  /* EB093 */
    0x00FD0800,  /* EB094 */
    0x00FD0000,  /* EB095 */
    0x00FCF800,  /* EB096 */
    0x00FCF000,  /* EB097 */
    0x00FCE800,  /* EB098 */
    0x00FCE000,  /* EB099 */
    0x00FCD800,  /* EB100 */
    0x00FCD000,  /* EB101 */
    0x00FCC800,  /* EB102 */
    0x00FCC000,  /* EB103 */
    0x00FCB800,  /* EB104 */
    0x00FCB000,  /* EB105 */
    0x00FCA800,  /* EB106 */
    0x00FCA000,  /* EB107 */
    0x00FC9800,  /* EB108 */
    0x00FC9000,  /* EB109 */
    0x00FC8800,  /* EB110 */
    0x00FC8000,  /* EB111 */
    0x00FC7800,  /* EB112 */
    0x00FC7000,  /* EB113 */
    0x00FC6800,  /* EB114 */
    0x00FC6000,  /* EB115 */
    0x00FC5800,  /* EB116 */
    0x00FC5000,  /* EB117 */
    0x00FC4800,  /* EB118 */
    0x00FC4000,  /* EB119 */
    0x00FC3800,  /* EB120 */
    0x00FC3000,  /* EB121 */
    0x00FC2800,  /* EB122 */
    0x00FC2000,  /* EB123 */
    0x00FC1800,  /* EB124 */
    0x00FC1000,  /* EB125 */
    0x00FC0800,  /* EB126 */
    0x00FC0000,  /* EB127 */
    0x00FBF800,  /* EB128 */
    0x00FBF000,  /* EB129 */
    0x00FBE800,  /* EB130 */
    0x00FBE000,  /* EB131 */
    0x00FBD800,  /* EB132 */
    0x00FBD000,  /* EB133 */
    0x00FBC800,  /* EB134 */
    0x00FBC000,  /* EB135 */
    0x00FBB800,  /* EB136 */
    0x00FBB000,  /* EB137 */
    0x00FBA800,  /* EB138 */
    0x00FBA000,  /* EB139 */
    0x00FB9800,  /* EB140 */
    0x00FB9000,  /* EB141 */
    0x00FB8800,  /* EB142 */
    0x00FB8000,  /* EB143 */
    0x00FB7800,  /* EB144 */
    0x00FB7000,  /* EB145 */
    0x00FB6800,  /* EB146 */
    0x00FB6000,  /* EB147 */
    0x00FB5800,  /* EB148 */
    0x00FB5000,  /* EB149 */
    0x00FB4800,  /* EB150 */
    0x00FB4000,  /* EB151 */
    0x00FB3800,  /* EB152 */
    0x00FB3000,  /* EB153 */
    0x00FB2800,  /* EB154 */
    0x00FB2000,  /* EB155 */
    0x00FB1800,  /* EB156 */
    0x00FB1000,  /* EB157 */
    0x00FB0800,  /* EB158 */
    0x00FB0000,  /* EB159 */
    0x00FAF800,  /* EB160 */
    0x00FAF000,  /* EB161 */
    0x00FAE800,  /* EB162 */
    0x00FAE000,  /* EB163 */
    0x00FAD800,  /* EB164 */
    0x00FAD000,  /* EB165 */
    0x00FAC800,  /* EB166 */
    0x00FAC000,  /* EB167 */
    0x00FAB800,  /* EB168 */
    0x00FAB000,  /* EB169 */
    0x00FAA800,  /* EB170 */
    0x00FAA000,  /* EB171 */
    0x00FA9800,  /* EB172 */
    0x00FA9000,  /* EB173 */
    0x00FA8800,  /* EB174 */
    0x00FA8000,  /* EB175 */
    0x00FA7800,  /* EB176 */
    0x00FA7000,  /* EB177 */
    0x00FA6800,  /* EB178 */
    0x00FA6000,  /* EB179 */
    0x00FA5800,  /* EB180 */
    0x00FA5000,  /* EB181 */
    0x00FA4800,  /* EB182 */
    0x00FA4000,  /* EB183 */
    0x00FA3800,  /* EB184 */
    0x00FA3000,  /* EB185 */
    0x00FA2800,  /* EB186 */
    0x00FA2000,  /* EB187 */
    0x00FA1800,  /* EB188 */
    0x00FA1000,  /* EB189 */
    0x00FA0800,  /* EB190 */
    0x00FA0000,  /* EB191 */
    0x00F9F800,  /* EB192 */
    0x00F9F000,  /* EB193 */
    0x00F9E800,  /* EB194 */
    0x00F9E000,  /* EB195 */
    0x00F9D800,  /* EB196 */
    0x00F9D000,  /* EB197 */
    0x00F9C800,  /* EB198 */
    0x00F9C000,  /* EB199 */
    0x00F9B800,  /* EB200 */
    0x00F9B000,  /* EB201 */
    0x00F9A800,  /* EB202 */
    0x00F9A000,  /* EB203 */
    0x00F99800,  /* EB204 */
    0x00F99000,  /* EB205 */
    0x00F98800,  /* EB206 */
    0x00F98000,  /* EB207 */
    0x00F97800,  /* EB208 */
    0x00F97000,  /* EB209 */
    0x00F96800,  /* EB210 */
    0x00F96000,  /* EB211 */
    0x00F95800,  /* EB212 */
    0x00F95000,  /* EB213 */
    0x00F94800,  /* EB214 */
    0x00F94000,  /* EB215 */
    0x00F93800,  /* EB216 */
    0x00F93000,  /* EB217 */
    0x00F92800,  /* EB218 */
    0x00F92000,  /* EB219 */
    0x00F91800,  /* EB220 */
    0x00F91000,  /* EB221 */
    0x00F90800,  /* EB222 */
    0x00F90000,  /* EB223 */
    0x00F8F800,  /* EB224 */
    0x00F8F000,  /* EB225 */
    0x00F8E800,  /* EB226 */
    0x00F8E000,  /* EB227 */
    0x00F8D800,  /* EB228 */
    0x00F8D000,  /* EB229 */
    0x00F8C800,  /* EB230 */
    0x00F8C000,  /* EB231 */
    0x00F8B800,  /* EB232 */
    0x00F8B000,  /* EB233 */
    0x00F8A800,  /* EB234 */
    0x00F8A000,  /* EB235 */
    0x00F89800,  /* EB236 */
    0x00F89000,  /* EB237 */
    0x00F88800,  /* EB238 */
    0x00F88000,  /* EB239 */
    0x00F87800,  /* EB240 */
    0x00F87000,  /* EB241 */
    0x00F86800,  /* EB242 */
    0x00F86000,  /* EB243 */
    0x00F85800,  /* EB244 */
    0x00F85000,  /* EB245 */
    0x00F84800,  /* EB246 */
    0x00F84000,  /* EB247 */
    0x00F83800,  /* EB248 */
    0x00F83000,  /* EB249 */
    0x00F82800,  /* EB250 */
    0x00F82000,  /* EB251 */
    0x00F81800,  /* EB252 */
    0x00F81000,  /* EB253 */
    0x00F80800,  /* EB254 */
    0x00F80000,  /* EB255 */
    0x00100000,  /* DB000 */
    0x00100800,  /* DB001 */
    0x00101000,  /* DB002 */
    0x00101800   /* DB003 */
};
#else 
extern const uint32_t g_flash_BlockAddresses[260];
#endif             

/* Define the clock frequency supplied to the FCU. On the RX610 and Rx62x
   this is the PCLK. On the RX63x it is the FCLK. */
#define FLASH_CLOCK_HZ BSP_FCLK_HZ

/*  According to HW Manual the Max Programming Time for 128 bytes (ROM)
    is 6ms.  This is with a FCLK of 32MHz. The calculation below
    calculates the number of ICLK ticks needed for the timeout delay.
    The 6ms number is adjusted linearly depending on the FCLK frequency.
*/
#define WAIT_MAX_ROM_WRITE \
        ((int32_t)(6000 * (32.0/(FLASH_CLOCK_HZ/1000000)))*(BSP_ICLK_HZ/1000000))

/*  According to HW Manual the Max Programming Time for 8 bytes
    (Data Flash) is 3.2ms.  This is with a FCLK of 32MHz. The calculation
    below calculates the number of ICLK ticks needed for the timeout delay.
    The 3.2ms number is adjusted linearly depending on the FCLK frequency.
*/
#define WAIT_MAX_DF_WRITE \
        ((int32_t)(3200 * (32.0/(FLASH_CLOCK_HZ/1000000)))*(BSP_ICLK_HZ/1000000))

/*  According to HW Manual the Max Blank Check time for 2k bytes
    (Data Flash) is 2.5ms.  This is with a FCLK of 32MHz. The calculation
    below calculates the number of ICLK ticks needed for the timeout delay.
    The 2.5ms number is adjusted linearly depending on the FCLK frequency.
*/
#define WAIT_MAX_BLANK_CHECK \
        ((int32_t)(2500 * (32.0/(FLASH_CLOCK_HZ/1000000)))*(BSP_ICLK_HZ/1000000))
        
/*  According to HW Manual the max timeout value when using the peripheral
    clock notification command is 60us. This is with a FCLK of 32MHz. The 
    calculation below calculates the number of ICLK ticks needed for the 
    timeout delay. The 60us number is adjusted linearly depending on 
    the FCLK frequency.
*/
#define WAIT_MAX_NOTIFY_FCU_CLOCK \
        ((int32_t)(60 * (32.0/(FLASH_CLOCK_HZ/1000000)))*(BSP_ICLK_HZ/1000000))         

/*  According to HW Manual the Max Erasure Time for a 2kB block is
    around 60ms.  This is with a FCLK of 32MHz. The calculation below
    calculates the number of ICLK ticks needed for the timeout delay.
    The 60ms number is adjusted linearly depending on the FCLK frequency.
*/
#define WAIT_MAX_ERASE \
        ((int32_t)(60000 * (32.0/(FLASH_CLOCK_HZ/1000000)))*(BSP_ICLK_HZ/1000000))    

/******************************************************************************
Error checking
******************************************************************************/
/* FCLK must be between 4MHz and 32MHz. */
#if (FLASH_CLOCK_HZ > 32000000) || (FLASH_CLOCK_HZ < 4000000)
    #error "ERROR - Flash API - FCLK on RX210 must be between 4MHz and 32MHz!"
#endif

#endif /* _FLASH_API_RX210_H */
